Autodesk.Revit.DB.ParameterSet
A set that contains parameters.

Autodesk.Revit.DB.ParameterSet.Insert(Autodesk.Revit.DB.Parameter)
System.Int32
Insert the specified parameter into the set.
item: The parameter to be inserted into the set.
Returns: Returns whether the parameter was inserted into the set.

Autodesk.Revit.DB.ParameterSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ParameterSet.ReverseIterator
Autodesk.Revit.DB.ParameterSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.ParameterSet.ForwardIterator
Autodesk.Revit.DB.ParameterSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.ParameterSet.Erase(Autodesk.Revit.DB.Parameter)
System.Int32
Removes a specified parameter from the set.
item: The parameter to be erased.
Returns: The number of parameters that were erased from the set.

Autodesk.Revit.DB.ParameterSet.Contains(Autodesk.Revit.DB.Parameter)
System.Boolean
Tests for the existence of a parameter within the set.
item: The parameter to be searched for.
Returns: The Contains method returns True if the parameter is within the set, otherwise False.

Autodesk.Revit.DB.ParameterSet.Clear
void
Removes every parameter from the set, rendering it empty.

Autodesk.Revit.DB.ParameterSet.Size
System.Int32
get
Returns the number of parameters that are in the set.

Autodesk.Revit.DB.ParameterSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.